/*Задание 2 *.

Дана json строка (можно сохранить в файл и читать из файла)
Написать метод(ы), который распарсит json и, используя StringBuilder, создаст строки вида:
Студент [фамилия] получил [оценка] по предмету [предмет].
Входная строка:

[{"фамилия":"Иванов","оценка":"5","предмет":"Математика"},{"фамилия":"Петрова","оценка":"4","предмет":"Информатика"},{"фамилия":"Краснов","оценка":"5","предмет":"Физика"}]
Выходная строка:

Студент Иванов получил 5 по предмету Математика.
Студент Петрова получил 4 по предмету Информатика.
Студент Краснов получил 5 по предмету Физика. */

public class Task_2 {
    public static void main(String[] args)  {
    System.out.print("\033\143");
    String str = "[{\"фамилия\":\"Иванов\",\"оценка\":\"5\",\"предмет\":\"Математика\"},{\"фамилия\":\"Петрова\",\"оценка\":\"4\",\"предмет\":\"Информатика\"},{\"фамилия\":\"Краснов\",\"оценка\":\"5\",\"предмет\":\"Физика\"}]";
    System.out.println(str);
    String[] text = {"Студент ","получил ","по предмету ", };
    StringBuilder sb = new StringBuilder();
    str = str.replace(",{", " ").replace("{", " ").replace("[", " ").replace("]", " ");
    str = str.replace('"',' ');
    
    String[] Array = str.split("}", 0);
    for (String item:Array){
        String[] strN = item.trim().split(",");
        int i = 0;
            for (String item1:strN){
                if (item1!=""){
                    String[] ArrayResult = item1.trim().split(":");
                    sb.append(text[i]).append(ArrayResult[1]).append(" ");
                    i++;
                }
            }
        System.out.println(sb);
        sb.delete(0, sb.length());
    }
    }
}
